using Microsoft.AspNetCore.Builder;
using Microsoft.Extensions.DependencyInjection;
using System.Linq;
using ToyMarket.Data.Models;
using System.Collections.Generic;

namespace ToyMarket.Data
{
    public class DBObjects
    {
        //функція для підключення до БД
        public static void Initial(AppDBContent content)
        {
            //якщо не має жодної категорії, то додаємо категорії
            if (!content.Category.Any())
            {
                content.Category.AddRange(Categories.Select(c => c.Value));
            }

            //якщо не має жодного товару, то додаємо товар
            if (!content.Toy.Any())
            {
                content.AddRange(
                    new Toy
                    {
                        name = "Our Generation Піа",
                        shortDesc = "46 см",
                        longDesc = "з довгим волоссям блонд 46 см",
                        img = "/img/1.jpg",
                        price = 1259,
                        isFavourite = true,
                        available = true,
                        Category = Categories["Лялька"]
                    },
                    new Toy
                    {
                        name = "Лялька Barbie Фруктовий сюрприз",
                        shortDesc = "Кольорове перевтілення",
                        longDesc = "Лялька Barbie Фруктовий сюрприз Кольорове перевтілення",
                        img = "/img/2.jpg",
                        price = 899,
                        isFavourite = false,
                        available = true,
                        Category = Categories["Лялька"]
                    },
                    new Toy
                    {
                        name = "Сокіл Тисячоліття Millennium Falcon",
                        shortDesc = "Конструктор LEGO Star Wars Сокіл Тисячоліття",
                        longDesc = "Легендарний «Сокіл тисячоліття» серії LEGO Star Wars щойно приземлився! Супершвидкий кореліанський зореліт Хана Соло складається з 7500 елементів і має круті деталі та класні функції. Тебе вразять витончені нюанси корпуса, тарілка антени, верхні та нижні чотиридульні лазерні гармати, 7 шасі, вантажний пандус, що опускається, та прихована бластерна гармата.",
                        img = "/img/3.jpg",
                        price = 30079,
                        isFavourite = false,
                        available = false,
                        Category = Categories["Конструктор LEGO"]
                    },
                    new Toy
                    {
                        name = "LEGO Super Mario Nintendo",
                        shortDesc = "Конструктор LEGO Super Mario Nintendo Entertainment System 2646 деталей",
                        longDesc = "Відтвори класичний геймплей Super Mario Bros. за допомогою цієї крутої Розважальної системи LEGO Nintendo. Установи Архів із грою на консоль, складену з кубиків. Поверни ручку ретротелевізора, щоб побачити на екрані восьмибітного Маріо. Потім помісти фігурку Маріо LEGO (не входить до комплекту) у спеціальний відсік нагорі, щоб поспостерігати, як він реагує на різних ворогів, перешкоди та посилення, що з'являються на екрані, і послухати оригінальну музику з гри.Пробудіть ностальгічні спогади, створюючи цей чудово пророблений кубик LEGO Nintendo Entertainment System (71374) й інтерактивний телевізор у стилі 1980-х, що демонструє класичну гру Super Mario Bros. Телевізор має екран прокручування, керований ручкою, і якщо ви проскануєте кубик дій, помістивши LEGO Mario (малюнок не входить до комплекту) у проріз згори, він реагуватиме на ворогів на екрані, перешкоди й бонуси. Справжні деталі консолі NES відтворені в стилі LEGO, включно з контролером і отвором для складання Game Pak із реалістичною функцією блокування, щоб потішити шанувальників Super Mario Bros.",
                        img = "/img/4.webp",
                        price = 9999,
                        isFavourite = true,
                        available = true,
                        Category = Categories["Конструктор LEGO"]
                    },
                    new Toy
                    {
                        name = "LEGO Classic Скринька для творчості",
                        shortDesc = "Конструктор LEGO Classic Скринька для творчості 213 деталей",
                        longDesc = "LEGO Classic допоможе вам розвинути у своїй дитині бажання творити. З яскравими, кольоровими, універсальними кубиками LEGO будь-яка творча гра стає простішою. Кожен набір містить класичні кубики LEGO, комплект спеціальних елементів і добірку ідей, щоб допомогти долучитися до гри. Тепер у вашої дитини є все, що потрібно їй для натхнення. У міру того, як діти вдосконалюватимуть свої навички складання, вони навчаться збирати, що завгодно: будинку, машини та тварин. А оскільки кубики LEGO Classic підходять для різних вікових груп, конструювання може стати розвагою для всієї сім'ї й розбудити уяву кожного з поколінь.",
                        img = "/img/5.webp",
                        price = 560,
                        isFavourite = true,
                        available = false,
                        Category = Categories["Конструктор LEGO"]
                    },
                    new Toy
                    {
                        name = "Спецтехніка Bruder трактор John Deere 9620RX ",
                        shortDesc = "Настільна гра Третя Планета Манчкін українська мова",
                        longDesc = "Bruder – це ліцензійні моделі дорожньої, будівельної, спеціальної автотехніки. Всі матеріали та комплектуючі виготовлені виключно в Німеччині, що гарантує їхню високу якість та безпеку. Вони вдало копіюють оригінали дорослих справжніх машин. Іграшки дуже функціональні та деталізовані.",
                        img = "/img/6.webp",
                        price = 5031,
                        isFavourite = true,
                        available = true,
                        Category = Categories["Машинка"]
                    },
                    new Toy
                    {
                        name = "Третя Планета Манчкін українська мова",
                        shortDesc = "Конструктор LEGO Super Mario Nintendo Entertainment System 2646 деталей",
                        longDesc = "Спуститися в темряву підземелля. Завалити там усе, що ворушиться. Обдурити друзів і вкрасти їхні пожитки. Схопити скарби й бігти щодуху… Зізнайся, тобі ж це подобається! Манчкін відтворює цю чудову атмосферу, але без нудного рольовізму. Ти тільки валити чудовиськ і дерибанити їхні скарби. А там магічні артефакти! Одягни Бугайську броню й Чоботи магічного пенделя. Озбройся Ціпком напалму… або навіть Бензопилкою кривавої різанини — і швидше в бій! Закочує Пацючиху з киянкою й Огидний слиз, а як злякаєшся Братів Зомбюкіних — можеш сміливо вирушати на полювання на самого плутонієвого дракона. Манчкін — динамічна та кумедна гра, яка може легко довести галасливу компанію до істерики. ",
                        img = "/img/7.webp",
                        price = 585,
                        isFavourite = true,
                        available = true,
                        Category = Categories["Настільна гра"]
                    },
                    new Toy
                    {
                        name = "Геометрика дитяча рибалка розвиваюча іграшка",
                        shortDesc = "Дерев'яні іграшки Геометрика дитяча рибалка розвиваюча іграшка",
                        longDesc = "Дерев'яна грушка працює за методикою Монтессорі – вивчаємо кольори, форм та цифри.",
                        img = "/img/8.webp",
                        price = 345,
                        isFavourite = true,
                        available = false,
                        Category = Categories["Розвивальна іграшка"]
                    }
                    );
            }
            content.SaveChanges(); //зберігаємо додані данні
        }

        private static Dictionary<string, Category> category;
        public static Dictionary<string, Category> Categories
        {
            get
            {
                if(category == null)
                {
                    //створення інфомаціїї для занесення в БД
                    var list = new Category[]
                    {
                        new Category {categoryName = "Лялька", desc =
                    "Іграшка у вигляді людини, зазвичай із рухомими кінцівками та різними аксесуарами."},
                    new Category {categoryName = "М'яка іграшка",
                    desc = "Плюшева іграшка, виконана з м'якого матеріалу."},
                    new Category {categoryName = "Конструктор",
                    desc = "Набір різнокольорових блоків або елементів, які можна з'єднувати та створювати різні конструкції."},
                    new Category {categoryName = "Машинка",
                    desc = "Мініатюрна іграшкова машина, що представляє різні види транспорту, такі як автомобілі, вантажівки або пожежні машини."},
                    new Category {categoryName = "Настільна гра",
                    desc = "Гра, яку грають на спеціальному ігровому полі або на дошці, яка зазвичай вимагає участі кількох гравців."},
                    new Category {categoryName = "Пазл",
                    desc = "Гра-головоломка, що складається з різних фрагментів, які потрібно правильно з'єднати, щоб отримати зображення."},
                    new Category {categoryName = "Розвивальна іграшка",
                    desc = "Іграшка, спеціально розроблена для розвитку навичок і умінь у дітей, таких як логіка, моторика або мова."},
                    new Category {categoryName = "Конструктор LEGO",
                    desc = "Іграшковий набір, що складається з безлічі маленьких деталей, за допомогою яких можна збирати різні моделі та конструкції."}
                    };

                    category = new Dictionary<string, Category>();
                    foreach (Category el in list)
                    {
                        category.Add(el.categoryName, el);
                    }
                }
                return category;
            }
        }

    }
}
